Revit 2025 API
RailTypeDefaultJoinOption Enumeration
 The default join type of the rail.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 25.0.0.0 (25.0.0.0)
Syntax
public enum RailTypeDefaultJoinOption
Public Enumeration RailTypeDefaultJoinOption
public enum class RailTypeDefaultJoinOption
type RailTypeDefaultJoinOption
Members
Member name | Value | Description
Miter | 0 |  The rails will be joined by a miter connection.
Fillet | 1 |  The rails will be joined by a fillet connection.
See Also
Reference
Autodesk.Revit.DB.Architecture Namespace